app/controllers/tutorials_controller.rb

INSERT INTO "tutorials" ("title", "explanation", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
		@tutorial = Tutorial.new(tutorial_params)

		if @tutorial.save

SELECT  "tutorials".* FROM "tutorials" WHERE "tutorials"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
	def edit
        @tutorial = Tutorial.find(params[:id])

SELECT  "tutorials".* FROM "tutorials" WHERE "tutorials"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@tutorial = Tutorial.find(params[:id])

SELECT  "tutorials".* FROM "tutorials" WHERE "tutorials"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "tutorials" SET "code" = ?, "updated_at" = ? WHERE "tutorials"."id" = ?  [["code", "function printNums(int a, int b) {<br>    for (a; a <= b: a++) {<br>        console.log(a)<br>    }<br>}<br>printNums(1, 10);"], ["updated_at", "2019-01-18 02:39:45.530614"], ["id", 11]]
---
	def update
	    @tutorial = Tutorial.find(params[:id])

		if @tutorial.update(tutorial_params)